package com.ayhalo.ecampus.databases.bean;

/**
 * com.ayhalo.ecampus.databases.bean
 * create by wuyh 2018/4/12.
 */

public class Article {


    /**
     * error : false
     * results : {"article_url":"http://fzxy.sqc.edu.cn/article-detail-984039.html","content":"<td style=\"TEXT-ALIGN: left; PADDING-BOTTOM: 0px; LINE-HEIGHT: 2; PADDING-LEFT: 0px; PADDING-RIGHT: 0px; VERTICAL-ALIGN: text-top; PADDING-TOP: 0px\" class=\"mod_font08_t       link_13\"><p align=\"justify\"/><p style=\"TEXT-INDENT: 28pt; mso-char-indent-count: 2.0\" class=\"MsoNormal\"><font style=\"FONT-SIZE: 20px\"><span style=\"FONT-FAMILY: &#23435;&#20307;\" lang=\"EN-US\" xml:lang=\"EN-US\">4<\/span><span style=\"FONT-FAMILY: &#23435;&#20307;\">&#26376;11&#26085;&#19979;&#21320;&#65292;&#39532;&#20811;&#24605;&#20027;&#20041;&#23398;&#38498;&#21484;&#24320;&#19987;&#39064;&#23398;&#20064;&#27963;&#21160;&#65292;&#38598;&#20013;&#20256;&#36798;&#23398;&#20064;&#26657;&#39532;&#20811;&#24605;&#20027;&#20041;&#23398;&#38498;&#24314;&#35774;&#25512;&#36827;&#20250;&#31934;&#31070;&#12290;&#27861;&#25919;&#23398;&#38498;&#21103;&#38498;&#38271;&#12289;&#39532;&#20811;&#24605;&#20027;&#20041;&#23398;&#38498;&#21103;&#38498;&#38271;&#26446;&#26126;&#24314;&#20027;&#25345;&#20250;&#35758;&#12290;<span lang=\"EN-US\" xml:lang=\"EN-US\"><xml:namespace/><\/span><\/span><\/font><\/p><p style=\"TEXT-INDENT: 28pt; mso-char-indent-count: 2.0\" class=\"MsoNormal\"><span style=\"FONT-FAMILY: &#23435;&#20307;; FONT-SIZE: 14pt\"><font style=\"FONT-SIZE: 20px\">&#26657;&#20826;&#22996;&#20070;&#35760;&#39038;&#26195;&#34382;&#22312;&#39532;&#20811;&#24605;&#20027;&#20041;&#23398;&#38498;&#19987;&#39064;&#35843;&#30740;&#26102;&#25351;&#20986;&#65292;&#25105;&#26657;&#31215;&#26497;&#23398;&#20064;&#36143;&#24443;&#20840;&#22269;&#39640;&#26657;&#24605;&#25919;&#20250;&#35758;&#31934;&#31070;&#65292;&#24605;&#25919;&#35838;&#32467;&#21512;&#23398;&#26657;&#21150;&#23398;&#23454;&#38469;&#65292;&#25945;&#23398;&#25913;&#38761;&#26377;&#22768;&#26377;&#33394;&#12290;&#20170;&#21518;&#65292;&#24605;&#25919;&#25945;&#25913;&#25104;&#26524;&#35201;&#36827;&#19968;&#27493;&#24635;&#32467;&#25552;&#28860;&#65292;&#20570;&#22823;&#20570;&#24378;&#24605;&#25919;&#35838;&#23454;&#36341;&#25945;&#23398;&#65292;&#21152;&#22823;&#23459;&#20256;&#21147;&#24230;&#65292;&#21152;&#24378;&#19982;&#23398;&#24037;&#31995;&#32479;&#32852;&#21160;&#65292;&#25226;&#21508;&#39033;&#24605;&#25919;&#27963;&#21160;&#19978;&#21319;&#21040;&#23398;&#26657;&#23618;&#38754;&#65292;&#31215;&#26497;&#26500;&#24314;&#22823;&#24605;&#25919;&#26684;&#23616;&#12290;<\/font><\/span><\/p><p style=\"TEXT-INDENT: 28pt; mso-char-indent-count: 2.0\" class=\"MsoNormal\"><span style=\"FONT-FAMILY: &#23435;&#20307;; FONT-SIZE: 14pt\"><font style=\"FONT-SIZE: 20px\">&#26446;&#26126;&#24314;&#21103;&#38498;&#38271;&#32467;&#21512;&#23398;&#38498;&#22312;&#24072;&#36164;&#12289;&#25945;&#23398;&#12289;&#31185;&#30740;&#21450;&#31038;&#20250;&#26381;&#21153;&#31561;&#26041;&#38754;&#29616;&#29366;&#65292;&#40723;&#21169;&#25945;&#24072;&#31215;&#26497;&#25506;&#32034;&#25945;&#23398;&#25913;&#38761;&#20010;&#24615;&#21270;&#25104;&#26524;&#65292;&#25512;&#36827;&#23454;&#36341;&#25945;&#23398;&#31934;&#21697;&#21270;&#65292;&#21152;&#24378;&#39640;&#27700;&#24179;&#30340;&#25945;&#23398;&#30740;&#31350;&#21644;&#31185;&#23398;&#30740;&#31350;&#22242;&#38431;&#24314;&#35774;&#65292;&#21162;&#21147;&#25171;&#36896;&#19968;&#25903;&#36866;&#24212;&#23398;&#26657;&#24212;&#29992;&#22411;&#20154;&#25165;&#22521;&#20859;&#30340;&#24605;&#25919;&#35838;&#25945;&#24072;&#38431;&#20237;&#12290;<\/font><\/span><\/p><p/><\/td>","create_time":"2018-04-12 23:38:17","id":9810,"img_url":"http://fzxy.sqc.edu.cn/article-detail-984039.html","publish_time":"2018-04-12","publisher":"法政学院","title":"马克思主义学院集中学习校马克思主义学院建设推进会精神"}
     */

    private String error;
    private ResultsBean results;

    public String getError() {
        return error;
    }

    public void setError(String error) {
        this.error = error;
    }

    public ResultsBean getResults() {
        return results;
    }

    public void setResults(ResultsBean results) {
        this.results = results;
    }

    public static class ResultsBean {
        /**
         * article_url : http://fzxy.sqc.edu.cn/article-detail-984039.html
         * content : <td style="TEXT-ALIGN: left; PADDING-BOTTOM: 0px; LINE-HEIGHT: 2; PADDING-LEFT: 0px; PADDING-RIGHT: 0px; VERTICAL-ALIGN: text-top; PADDING-TOP: 0px" class="mod_font08_t       link_13"><p align="justify"/><p style="TEXT-INDENT: 28pt; mso-char-indent-count: 2.0" class="MsoNormal"><font style="FONT-SIZE: 20px"><span style="FONT-FAMILY: &#23435;&#20307;" lang="EN-US" xml:lang="EN-US">4</span><span style="FONT-FAMILY: &#23435;&#20307;">&#26376;11&#26085;&#19979;&#21320;&#65292;&#39532;&#20811;&#24605;&#20027;&#20041;&#23398;&#38498;&#21484;&#24320;&#19987;&#39064;&#23398;&#20064;&#27963;&#21160;&#65292;&#38598;&#20013;&#20256;&#36798;&#23398;&#20064;&#26657;&#39532;&#20811;&#24605;&#20027;&#20041;&#23398;&#38498;&#24314;&#35774;&#25512;&#36827;&#20250;&#31934;&#31070;&#12290;&#27861;&#25919;&#23398;&#38498;&#21103;&#38498;&#38271;&#12289;&#39532;&#20811;&#24605;&#20027;&#20041;&#23398;&#38498;&#21103;&#38498;&#38271;&#26446;&#26126;&#24314;&#20027;&#25345;&#20250;&#35758;&#12290;<span lang="EN-US" xml:lang="EN-US"><xml:namespace/></span></span></font></p><p style="TEXT-INDENT: 28pt; mso-char-indent-count: 2.0" class="MsoNormal"><span style="FONT-FAMILY: &#23435;&#20307;; FONT-SIZE: 14pt"><font style="FONT-SIZE: 20px">&#26657;&#20826;&#22996;&#20070;&#35760;&#39038;&#26195;&#34382;&#22312;&#39532;&#20811;&#24605;&#20027;&#20041;&#23398;&#38498;&#19987;&#39064;&#35843;&#30740;&#26102;&#25351;&#20986;&#65292;&#25105;&#26657;&#31215;&#26497;&#23398;&#20064;&#36143;&#24443;&#20840;&#22269;&#39640;&#26657;&#24605;&#25919;&#20250;&#35758;&#31934;&#31070;&#65292;&#24605;&#25919;&#35838;&#32467;&#21512;&#23398;&#26657;&#21150;&#23398;&#23454;&#38469;&#65292;&#25945;&#23398;&#25913;&#38761;&#26377;&#22768;&#26377;&#33394;&#12290;&#20170;&#21518;&#65292;&#24605;&#25919;&#25945;&#25913;&#25104;&#26524;&#35201;&#36827;&#19968;&#27493;&#24635;&#32467;&#25552;&#28860;&#65292;&#20570;&#22823;&#20570;&#24378;&#24605;&#25919;&#35838;&#23454;&#36341;&#25945;&#23398;&#65292;&#21152;&#22823;&#23459;&#20256;&#21147;&#24230;&#65292;&#21152;&#24378;&#19982;&#23398;&#24037;&#31995;&#32479;&#32852;&#21160;&#65292;&#25226;&#21508;&#39033;&#24605;&#25919;&#27963;&#21160;&#19978;&#21319;&#21040;&#23398;&#26657;&#23618;&#38754;&#65292;&#31215;&#26497;&#26500;&#24314;&#22823;&#24605;&#25919;&#26684;&#23616;&#12290;</font></span></p><p style="TEXT-INDENT: 28pt; mso-char-indent-count: 2.0" class="MsoNormal"><span style="FONT-FAMILY: &#23435;&#20307;; FONT-SIZE: 14pt"><font style="FONT-SIZE: 20px">&#26446;&#26126;&#24314;&#21103;&#38498;&#38271;&#32467;&#21512;&#23398;&#38498;&#22312;&#24072;&#36164;&#12289;&#25945;&#23398;&#12289;&#31185;&#30740;&#21450;&#31038;&#20250;&#26381;&#21153;&#31561;&#26041;&#38754;&#29616;&#29366;&#65292;&#40723;&#21169;&#25945;&#24072;&#31215;&#26497;&#25506;&#32034;&#25945;&#23398;&#25913;&#38761;&#20010;&#24615;&#21270;&#25104;&#26524;&#65292;&#25512;&#36827;&#23454;&#36341;&#25945;&#23398;&#31934;&#21697;&#21270;&#65292;&#21152;&#24378;&#39640;&#27700;&#24179;&#30340;&#25945;&#23398;&#30740;&#31350;&#21644;&#31185;&#23398;&#30740;&#31350;&#22242;&#38431;&#24314;&#35774;&#65292;&#21162;&#21147;&#25171;&#36896;&#19968;&#25903;&#36866;&#24212;&#23398;&#26657;&#24212;&#29992;&#22411;&#20154;&#25165;&#22521;&#20859;&#30340;&#24605;&#25919;&#35838;&#25945;&#24072;&#38431;&#20237;&#12290;</font></span></p><p/></td>
         * create_time : 2018-04-12 23:38:17
         * id : 9810
         * img_url : http://fzxy.sqc.edu.cn/article-detail-984039.html
         * publish_time : 2018-04-12
         * publisher : 法政学院
         * title : 马克思主义学院集中学习校马克思主义学院建设推进会精神
         */

        private String article_url;
        private String content;
        private String create_time;
        private int id;
        private String img_url;
        private String publish_time;
        private String publisher;
        private String title;

        public String getArticle_url() {
            return article_url;
        }

        public void setArticle_url(String article_url) {
            this.article_url = article_url;
        }

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }

        public String getCreate_time() {
            return create_time;
        }

        public void setCreate_time(String create_time) {
            this.create_time = create_time;
        }

        public int getId() {
            return id;
        }

        public void setId(int id) {
            this.id = id;
        }

        public String getImg_url() {
            return img_url;
        }

        public void setImg_url(String img_url) {
            this.img_url = img_url;
        }

        public String getPublish_time() {
            return publish_time;
        }

        public void setPublish_time(String publish_time) {
            this.publish_time = publish_time;
        }

        public String getPublisher() {
            return publisher;
        }

        public void setPublisher(String publisher) {
            this.publisher = publisher;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }
    }
}
